ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/ОбращениеПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеПользователя</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителей</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеакции</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтекОшибок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНерабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Просрочено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ПользователиИТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationServiceDesk/src/Catalogs/СтатусыОбращений/СтатусыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбращений</name>
  <predefined>
    <items>
      <name>Новое</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Назначено</name>
      <description>Назначено</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Решено</name>
      <description>Решено</description>
    </items>
    <items>
      <name>ВозвратВРаботу</name>
      <description>Возврат в работу</description>
    </items>
    <items>
      <name>Отклонено</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>НаПодтверждении</name>
      <description>На подтверждении</description>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветДляИнтерфейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// 1. Стандартная проверка на загрузку
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Пытаемся назначить исполнителя, если его нет
	// Это заполнит поле "Исполнитель", если сработает ваш алгоритм поиска
	Если ЭтоНовый() Или Исполнитель.Пустая() Тогда
		НазначитьИсполнителяАвтоматически();
	КонецЕсли;
	
	// 3. Управление статусами
	// Получаем текущее имя статуса для проверок (убираем лишние пробелы)
	ИмяТекущегоСтатуса = СокрЛП(Статус.Наименование);
	
	// Проверяем: если документ уже "Решено" или "Закрыто", мы его вообще не трогаем
	Если ИмяТекущегоСтатуса <> "Решено" И ИмяТекущегоСтатуса <> "Закрыто" И ИмяТекущегоСтатуса <> "В работе" И ИмяТекущегоСтатуса <> "Возврат в работу" Тогда
		
		Если Исполнитель.Пустая() Тогда
			
			// Исполнителя нет — ставим статус "Новое"
			СтатусНовое = Справочники.СтатусыОбращений.НайтиПоНаименованию("Новое");
			Если Не СтатусНовое.Пустая() Тогда
				Статус = СтатусНовое;
			КонецЕсли;
			
		Иначе
			
			// Исполнитель ЕСТЬ. 
			// Но меняем статус на "Назначено" только если сейчас он "Новое" или не заполнен.
			// Это нужно, чтобы не "откатить" статус, если работа уже "В процессе".
			Если ИмяТекущегоСтатуса = "Новое" Или Статус.Пустая() Тогда
				
				СтатусНазначено = Справочники.СтатусыОбращений.НайтиПоНаименованию("Назначено");
				Если Не СтатусНазначено.Пустая() Тогда
					Статус = СтатусНазначено;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	// Если Сервис и Приоритет не заполнены, расчет не делаем
  Если ЗначениеЗаполнено(Сервис) И ЗначениеЗаполнено(Приоритет) И Статус = СтатусНазначено Тогда
    
    // 1. Вызываем ваш общий модуль
    СтруктСЛА = СерверСервисДеск.РассчитатьSLA(Сервис, Приоритет);
    
    // 2. Присваиваем значения реквизитам документа
    ЭтотОбъект.СрокРеакции = СтруктСЛА.СрокРеакции;
    
    // 3. Сразу вычисляем просрочку
    Если ЗначениеЗаполнено(ЭтотОбъект.СрокРеакции) Тогда
      ЭтотОбъект.Просрочено = (ТекущаяДата() > ЭтотОбъект.СрокРеакции);
    КонецЕсли;
    
  КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НазначитьИсполнителяАвтоматически()
	
	// 1. Проверяем группу в документе
	Если ГруппаИсполнителей.Пустая() И ЗначениеЗаполнено(Сервис) Тогда
		ГруппаИсполнителей = Сервис.ГруппаИсполнителей; 
	КонецЕсли;
	
	Если ГруппаИсполнителей.Пустая() Тогда
		Возврат; // Нет группы - нет смысла искать
	КонецЕсли;
	
	// 2. Ищем статусы. УБЕДИСЬ, что в справочнике они называются ТОЧНО так
	СтатусРешено = Справочники.СтатусыОбращений.НайтиПоНаименованию("Решено");
	СтатусЗакрыто = Справочники.СтатусыОбращений.НайтиПоНаименованию("Закрыто");
	
	// Если вдруг не нашли, создадим пустые ссылки нужного типа, чтобы запрос не выдавал ошибку по параметрам
	Если СтатусРешено.Пустая() Тогда СтатусРешено = Справочники.СтатусыОбращений.ПустаяСсылка(); КонецЕсли;
	Если СтатусЗакрыто.Пустая() Тогда СтатусЗакрыто = Справочники.СтатусыОбращений.ПустаяСсылка(); КонецЕсли;

	// 3. Запрос по справочнику ИСПОЛНИТЕЛИ
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Исполнители.Ссылка КАК ИсполнительСсылка
	|ИЗ
	|	Справочник.Исполнители КАК Исполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбращениеПользователя КАК Обращения
	|		ПО Исполнители.Ссылка = Обращения.Исполнитель
	|			И (Обращения.Статус <> &СтатусРешено И Обращения.Статус <> &СтатусЗакрыто)
	|ГДЕ
	|	Исполнители.Группа = &ГруппаОтбора
	|	И Исполнители.ПометкаУдаления = ЛОЖЬ
	|	И Исполнители.Наименование <> """"
	|СГРУППИРОВАТЬ ПО
	|	Исполнители.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	КОЛИЧЕСТВО(Обращения.Ссылка) ВОЗР";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ГруппаОтбора", ГруппаИсполнителей);
	Запрос.УстановитьПараметр("СтатусРешено", СтатусРешено);
	Запрос.УстановитьПараметр("СтатусЗакрыто", СтатусЗакрыто);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		// Назначаем реквизиту документа
		ЭтотОбъект.Исполнитель = Выборка.ИсполнительСсылка;
		Сообщить("УСПЕХ! Назначен: " + ЭтотОбъект.Исполнитель);
	Иначе
		Сообщить("Автоназначение: Не найдено сотрудников в группе " + ГруппаИсполнителей);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
